{
  "title": "LayerCSS .lyc",
  "language-selector-label": "Seleccionar Idioma:",
  "header-title": "LayerCSS - Lenguaje de Programación",
  "header-license": "Licencia: Apache 2.0",
  "introduction-title": "1. Introducción",
  "introduction-description": "<strong>¿Qué es LayerCSS?</strong> LayerCSS es un lenguaje de diseño basado en CSS que introduce características avanzadas para facilitar la creación de estilos modulares, reutilizables y mantenibles. Está diseñado para superar las limitaciones del CSS tradicional al agregar soporte para variables globales y locales, bloques anidados, capas (@layer) y comentarios estructurados.",
  "introduction-quote": "Modularidad: Divide tus estilos en secciones lógicas.<br>Reutilización: Define valores una vez y úsalos en múltiples lugares.<br>Fácil Mantenimiento: Cambia un valor en un lugar y afecta todo el proyecto.",
  "introduction-creator": "<em>Creador:</em> Sebastián (Balthier) Ordoñez Arias, un programador aficionado con conocimientos básicos en diseño web y desarrollo de aplicaciones. Este proyecto nació como una exploración personal para simplificar el desarrollo de CSS y hacerlo accesible para todos.",
  "lyc-title": "2. ¿Qué es .lyc?",
  "lyc-description": "El formato de archivo `.lyc` es el núcleo de LayerCSS. Extiende el CSS tradicional introduciendo una nueva sintaxis y características que hacen que el estilo sea más intuitivo y eficiente. Aquí hay algunos aspectos clave:",
  "lyc-feature-syntax": "<strong>Sintaxis:</strong> Similar a CSS pero con características adicionales como variables, anidación y capas.",
  "lyc-feature-modularity": "<strong>Modularidad:</strong> Organiza tus estilos en componentes reutilizables.",
  "lyc-feature-compilation": "<strong>Compilación:</strong> Los archivos `.lyc` se compilan en CSS estándar para compatibilidad con navegadores.",
  "features-title": "3. Características Clave",
  "feature-global-variables": "<strong>Variables Globales y Locales:</strong> Define valores reutilizables como colores y tamaños de fuente.",
  "feature-nested-blocks": "<strong>Bloques Anidados:</strong> Escribe estilos jerárquicamente para mejorar la legibilidad.",
  "feature-layers": "<strong>Capas (@layer):</strong> Organiza los estilos en secciones lógicas.",
  "feature-comments": "<strong>Comentarios Estructurados:</strong> Usa comentarios de una sola línea y multilínea para documentación.",
  "feature-animations": "<strong>Animaciones y Keyframes:</strong> Simplifica los efectos visuales dinámicos.",
  "example-title": "4. Ejemplo Detallado",
  "example-description": "A continuación, se muestra un ejemplo básico de un archivo `.lyc` con comentarios detallados que explican cada parte del código. Este archivo utiliza las características fundamentales de LYC: <strong>variables globales</strong>, <strong>`calc()`</strong>, <strong>mixins (`@mixin` y `@include`)</strong>, y <strong>herencia con `@extend`</strong>.",
  "comparison-title": "Comparación: .lyc vs .css",
  "compiler-title": "5. Espacio del Compilador",
  "conclusion-title": "6. Conclusión",
  "conclusion-description": "LayerCSS simplifica el desarrollo de CSS con características avanzadas como variables, bloques anidados y capas. Es ideal tanto para proyectos pequeños como grandes.",
  "conclusion-note": "<em>Nota del Creador:</em> Este proyecto está en sus primeras etapas. ¡Tu contribución será invaluable!",
  "footer-text": "&copy; 2025 LayerCSS. Distribuido bajo la Licencia Apache 2.0."
}
