{
  "title": "LayerCSS .lyc",
  "language-selector-label": "Seleziona Lingua:",
  "header-title": "Documentazione di LayerCSS",
  "header-license": "Licenza: Apache 2.0",
  "introduction-title": "1. Introduzione",
  "introduction-description": "<strong>Cos'è LayerCSS?</strong> LayerCSS è un linguaggio di design basato su CSS che introduce funzionalità avanzate per facilitare la creazione di stili modulari, riutilizzabili e manutenibili. È progettato per superare i limiti del CSS tradizionale aggiungendo supporto per variabili globali e locali, blocchi nidificati, livelli (@layer) e commenti strutturati.",
  "introduction-quote": "Modularità: Dividi i tuoi stili in sezioni logiche.<br>Riutilizzo: Definisci i valori una volta e usali in più punti.<br>Facilità di Manutenzione: Cambia un valore in un punto e influenzerai l'intero progetto.",
  "introduction-creator": "<em>Creatore:</em> Sebastián (Balthier) Ordoñez Arias, un programmatore amatoriale con conoscenze di base in web design e sviluppo applicativo. Questo progetto è nato come esplorazione personale per semplificare lo sviluppo di CSS e renderlo accessibile a tutti.",
  "lyc-title": "2. Cos'è .lyc?",
  "lyc-description": "Il formato file `.lyc` è il cuore di LayerCSS. Estende il CSS tradizionale introducendo una nuova sintassi e funzionalità che rendono lo styling più intuitivo ed efficiente. Ecco alcuni aspetti chiave:",
  "lyc-feature-syntax": "<strong>Sintassi:</strong> Simile a CSS ma con funzionalità aggiuntive come variabili, annidamento e livelli.",
  "lyc-feature-modularity": "<strong>Modularità:</strong> Organizza i tuoi stili in componenti riutilizzabili.",
  "lyc-feature-compilation": "<strong>Compilazione:</strong> I file `.lyc` vengono compilati in CSS standard per la compatibilità con i browser.",
  "features-title": "3. Caratteristiche Principali",
  "feature-global-variables": "<strong>Variabili Globali e Locali:</strong> Definisci valori riutilizzabili come colori e dimensioni del carattere.",
  "feature-nested-blocks": "<strong>Blocchi Annidati:</strong> Scrivi stili gerarchicamente per migliorare la leggibilità.",
  "feature-layers": "<strong>Livelli (@layer):</strong> Organizza gli stili in sezioni logiche.",
  "feature-comments": "<strong>Commenti Strutturati:</strong> Usa commenti a riga singola e multi-riga per la documentazione.",
  "feature-animations": "<strong>Animazioni e Keyframes:</strong> Semplifica gli effetti visivi dinamici.",
  "use-case-title": "4. Caso d'Uso nel Mondo Reale",
  "use-case-description": "Un sito web aziendale può utilizzare LayerCSS per organizzare gli stili in livelli per base, componenti e utilità. Questo approccio modulare consente agli sviluppatori di lavorare su diverse parti del progetto senza interferire tra loro.",
  "comparison-title": "5. Confronto con Framework Moderni",
  "comparison-header-feature": "Caratteristica",
  "comparison-header-tailwind": "Tailwind CSS",
  "comparison-header-bootstrap": "Bootstrap",
  "comparison-header-layercss": "LayerCSS",
  "comparison-row-modularity": "Modularità",
  "comparison-tailwind-modularity": "Alta",
  "comparison-bootstrap-modularity": "Media",
  "comparison-layercss-modularity": "Alta",
  "comparison-row-reusability": "Riutilizzo",
  "comparison-tailwind-reusability": "Media",
  "comparison-bootstrap-reusability": "Bassa",
  "comparison-layercss-reusability": "Alta",
  "comparison-row-ease-of-use": "Facilità d'Uso",
  "comparison-tailwind-ease-of-use": "Media",
  "comparison-bootstrap-ease-of-use": "Alta",
  "comparison-layercss-ease-of-use": "Alta",
  "compiler-title": "6. Spazio del Compilatore",
  "conclusion-title": "7. Conclusione",
  "conclusion-description": "LayerCSS semplifica lo sviluppo di CSS con funzionalità avanzate come variabili, blocchi annidati e livelli. È ideale sia per progetti piccoli che grandi.",
  "conclusion-note": "<em>Nota del Creatore:</em> Questo progetto è ancora nelle sue fasi iniziali. Il tuo contributo sarà prezioso!",
  "footer-text": "&copy; 2025 LayerCSS. Distribuito sotto Licenza Apache 2.0."
}
