{
  "aboutTitle": "Informazioni su LayerCSS",
  "aboutDescription": "LayerCSS è un linguaggio di design basato su CSS che introduce funzionalità avanzate per facilitare la creazione di stili modulari, riutilizzabili e mantenibili.",
  "compilerTitle": "Compilatore LYC in CSS",
  "examplesTitle": "Esempi",
  "compileButton": "Compila",
  "featuresTitle": "Caratteristiche Chiave",
  "philosophyTitle": "Filosofia dietro LayerCSS",
  "comparisonTitle": "Vantaggi rispetto a progetti simili",
  "characteristic": "Caratteristica",
  "high": "Alta",
  "medium": "Media",
  "low": "Bassa",
  "yes": "Sì",
  "no": "No",
  "withPlugins": "Sì (con plugin)",
  "placeholder": "Scrivi il tuo codice LYC qui...",
  "footerText": "© 2025 LayerCSS. Tutti i diritti riservati. Licenza Apache 2.0.",
  "features": {
    "globalVariables": "Variabili Globali e Locali: Definisci valori riutilizzabili in tutto il progetto o all'interno di blocchi specifici.",
    "nestedBlocks": "Blocchi Annidati: Scrivi stili gerarchicamente per migliorare la leggibilità e ridurre la ripetizione dei selettori.",
    "layers": "Strati (@layer): Organizza gli stili in sezioni logiche come base, componenti o utilità.",
    "comments": "Commenti Strutturati: Supporta commenti su una riga (//) e su più righe (/* ... */).",
    "animations": "Supporto per Animazioni e Keyframes: Crea effetti visivi dinamici facilmente."
  },
  "philosophy": {
    "modularity": "Modularità: Dividi i tuoi stili in sezioni logiche.",
    "reusability": "Riutilizzo: Definisci i valori una volta e usali in più punti.",
    "maintainability": "Facilità di manutenzione: Cambia un valore in un punto e influenzi l'intero progetto."
  },
  "comparison": {
    "title": "Vantaggi rispetto a progetti simili",
    "simplicity": "Semplicità: Più facile da imparare e usare rispetto a Sass o Less.",
    "lightweight": "Leggero: Non richiede configurazioni complesse o strumenti aggiuntivi.",
    "compatibility": "Compatibilità: Il CSS generato è completamente compatibile con i browser moderni."
  }
}
