{
  "title": "LayerCSS .lyc",
  "language-selector-label": "Seleziona Lingua:",
  "header-title": "LayerCSS - Linguaggio di Programmazione",
  "header-license": "Licenza: Apache 2.0",
  "introduction-title": "Introduzione",
  "introduction-description": "<strong>Che cos'è LayerCSS?</strong> LayerCSS è un linguaggio di design basato su CSS che introduce funzionalità avanzate per facilitare la creazione di stili modulari, riutilizzabili e manutenibili.",
  "introduction-quote": "Modularità: Dividi i tuoi stili in sezioni logiche.<br>Riusabilità: Definisci i valori una volta e usali in più posti.<br>Facilità di Manutenzione: Cambia un valore in un posto e influenzerai tutto il progetto.",
  "introduction-creator": "<em>Creatore:</em> Sebastián (Balthier) Ordoñez Arias, un programmatore dilettante con conoscenze di base in web design e sviluppo applicativo.",
  "lyc-title": "Che cos'è .lyc?",
  "lyc-description": "Il formato di file `.lyc` è il nucleo di LayerCSS. Estende il CSS tradizionale introducendo una nuova sintassi e funzionalità che rendono lo stile più intuitivo ed efficiente.",
  "lyc-feature-syntax": "<strong>Sintassi:</strong> Simile a CSS ma con funzionalità aggiuntive come variabili, nidificazione e layer.",
  "lyc-feature-modularity": "<strong>Modularità:</strong> Organizza i tuoi stili in componenti riutilizzabili.",
  "lyc-feature-compilation": "<strong>Compilazione:</strong> I file `.lyc` vengono compilati in CSS standard per la compatibilità con i browser.",
  "features-title": "Caratteristiche Principali",
  "feature-global-variables": "<strong>Variabili Globali e Locali:</strong> Definisci valori riutilizzabili come colori e dimensioni dei caratteri.",
  "feature-nested-blocks": "<strong>Blocchi Annidati:</strong> Scrivi stili gerarchicamente per migliorare la leggibilità.",
  "feature-layers": "<strong>Layer (@layer):</strong> Organizza gli stili in sezioni logiche.",
  "feature-comments": "<strong>Commenti Strutturati:</strong> Usa commenti su una riga e multilinea per la documentazione.",
  "feature-animations": "<strong>Animazioni e Keyframes:</strong> Semplifica gli effetti visivi dinamici.",
  "example-title": "Esempio Dettagliato",
  "example-description": "Di seguito è riportato un esempio di base di un file `.lyc` con commenti dettagliati che spiegano ogni parte del codice. Questo file utilizza le funzionalità fondamentali di LYC: <strong>variabili globali</strong>, <strong>`calc()`</strong>, <strong>mixin (`@mixin` e `@include`)</strong>, e <strong>ereditarietà con `@extend`</strong>.",
  "example-lyc-title": "Esempio di Codice LYC",
  "example-lyc-description": "Di seguito è riportato un esempio di codice LYC che puoi copiare e incollare nel compilatore per testarne le funzionalità.",
  "comparison-title": "Confronto: .lyc vs .css",
  "comparison-characteristic": "Caratteristica",
  "comparison-variables": "Variabili",
  "comparison-nested-blocks": "Blocchi Annidati",
  "comparison-layers": "Layer",
  "comparison-comments": "Commenti",
  "comparison-animations": "Animazioni",
  "comparison-learning-curve": "Curva di Apprendimento",
  "sass-variables": "Supportato",
  "less-variables": "Supportato",
  "postcss-variables": "Supportato tramite plugin",
  "layercss-variables": "Supporto nativo",
  "sass-nested-blocks": "Supportato",
  "less-nested-blocks": "Supportato",
  "postcss-nested-blocks": "Supportato tramite plugin",
  "layercss-nested-blocks": "Supporto nativo",
  "sass-layers": "Non supportato",
  "less-layers": "Non supportato",
  "postcss-layers": "Supportato tramite plugin",
  "layercss-layers": "Supporto nativo",
  "sass-comments": "Commenti standard CSS",
  "less-comments": "Commenti standard CSS",
  "postcss-comments": "Commenti standard CSS",
  "layercss-comments": "Commenti strutturati",
  "sass-animations": "Supportato",
  "less-animations": "Supportato",
  "postcss-animations": "Supportato tramite plugin",
  "layercss-animations": "Supporto nativo",
  "sass-learning-curve": "Moderata",
  "less-learning-curve": "Facile",
  "postcss-learning-curve": "Moderata",
  "layercss-learning-curve": "Facile",
  "compiler-title": "Spazio del Compilatore",
  "compile-button": "Compila",
  "code-input": "Scrivi il tuo codice LayerCSS qui...",
  "output": "Output CSS",
  "process-title": "Processo Attuale e Futuro",
  "current-process-title": "Dove siamo nel processo?",
  "current-process-description": "Finora, abbiamo implementato un preprocessore o interprete parziale per il linguaggio LYC. Questo preprocessore esegue i seguenti compiti:",
  "current-process-feature-vars": "Sostituzione di variabili: Elabora variabili globali e locali (usando var(--nome)).",
  "current-process-feature-math": "Espressioni matematiche: Valuta espressioni all'interno di calc().",
  "current-process-feature-mixins": "Mixins (@mixin e @include): Permette il riutilizzo del codice tramite mixins.",
  "current-process-feature-extend": "Ereditarietà con @extend: Riutilizza stili tra selettori.",
  "current-process-feature-dynamic": "Strutture dinamiche: Usa malloc e realloc per gestire variabili, mixins e altri elementi in modo dinamico.",
  "current-process-feature-local-scope": "Ambiti locali: Le variabili locali sono memorizzate in uno stack e non appaiono nel file di output.",
  "current-process-note": "Tuttavia, questo è solo un compilatore parziale, poiché ci sono ancora diverse fasi importanti del processo di compilazione da implementare.",
  "compiler-stages-title": "Cosa verrà aggiunto",
  "compiler-stages-description": "Per trasformare il nostro preprocessore in un compilatore completo, dobbiamo aggiungere le seguenti funzionalità:",
  "compiler-stages-subtitle": "A. Fasi di un compilatore completo",
  "compiler-stage-lexing": "Analisi lessicale (Lexing): Converte il codice sorgente in token (parole chiave, identificatori, operatori, ecc.).",
  "compiler-stage-parsing": "Analisi sintattica (Parsing): Costruisce un Albero Sintattico Astratto (AST) dai token generati dal lexer.",
  "compiler-stage-semantic": "Analisi semantica: Verifica che l'AST sia valido secondo le regole del linguaggio.",
  "compiler-stage-intermediate-code": "Generazione di codice intermedio: Traduce l'AST in un formato intermedio più facile da ottimizzare o compilare.",
  "compiler-stage-optimization": "Ottimizzazione: Migliora il codice intermedio per renderlo più efficiente.",
  "compiler-stage-final-code": "Generazione del codice finale: Produce il file di output nel formato desiderato (in questo caso, CSS).",
  "additional-features-title": "B. Funzionalità aggiuntive che possono essere aggiunte",
  "additional-features-description": "Oltre alle fasi del compilatore, possiamo aggiungere le seguenti funzionalità specifiche per LYC:",
  "additional-feature-functions": "Supporto per funzioni avanzate: Implementa funzioni personalizzate in LYC, come darken(color, percentage) o lighten(color, percentage).",
  "additional-feature-nested-rules": "Regole nidificate avanzate: Permette regole CSS nidificate più complesse, simili a quelle trovate in SASS o LESS.",
  "additional-feature-strict-mode": "Modalità strict: Aggiunge una modalità strict che rileva errori potenziali, come variabili non utilizzate o regole duplicate.",
  "additional-feature-tools-integration": "Compatibilità con strumenti esterni: Integra LYC con strumenti come PostCSS o Autoprefixer per migliorare la compatibilità con i browser.",
  "additional-feature-minification": "Minificazione automatica: Aggiunge un'opzione per generare automaticamente CSS minificato.",
  "additional-feature-debugging": "Debugging: Include commenti nel CSS generato per facilitare il debug.",
  "additional-feature-documentation": "Documentazione ed esempi: Crea documentazione dettagliata per LYC e fornisce esempi di utilizzo.",
  "conclusion-title": "Conclusione",
  "conclusion-description": "LayerCSS semplifica lo sviluppo di CSS con funzionalità avanzate come variabili, blocchi annidati e layer. È ideale sia per progetti piccoli che grandi.",
  "conclusion-note": "<em>Nota del Creatore:</em> Questo progetto è ancora nelle sue prime fasi. La tua contribuzione sarà preziosa!",
  "footer-text": "&copy; 2025 LayerCSS. Distribuito sotto Licenza Apache 2.0."
}
