{
  "aboutTitle": "О LayerCSS",
  "aboutDescription": "LayerCSS — это язык дизайна на основе CSS, который вводит расширенные функции для упрощения создания модульных, повторно используемых и поддерживаемых стилей.",
  "compilerTitle": "Компилятор LYC в CSS",
  "examplesTitle": "Примеры",
  "compileButton": "Компилировать",
  "features": {
    "globalVariables": "Глобальные и локальные переменные: Определяйте повторно используемые значения в проекте или внутри конкретных блоков.",
    "nestedBlocks": "Вложенные блоки: Пишите стили иерархически для улучшения читаемости и уменьшения повторения селекторов.",
    "layers": "Слои (@layer): Организуйте стили в логические разделы, такие как база, компоненты или утилиты.",
    "comments": "Структурированные комментарии: Поддержка однострочных (//) и многострочных (/* ... */) комментариев.",
    "animations": "Поддержка анимаций и ключевых кадров: Легко создавайте динамические визуальные эффекты."
  },
  "philosophy": {
    "modularity": "Модульность: Разделяйте свои стили на логические разделы.",
    "reusability": "Повторное использование: Определите значение один раз и используйте его в нескольких местах.",
    "maintainability": "Удобство обслуживания: Измените значение в одном месте и повлияйте на весь проект."
  },
  "comparison": {
    "title": "Преимущества перед похожими проектами",
    "simplicity": "Простота: Проще учиться и использовать, чем Sass или Less.",
    "lightweight": "Легковесность: Не требует сложных настроек или дополнительных инструментов.",
    "compatibility": "Совместимость: Сгенерированный CSS полностью совместим с современными браузерами."
  },
  "conclusion": "LayerCSS — это мощный инструмент, упрощающий разработку на CSS. Его расширенные функции, такие как глобальные и локальные переменные, вложенные блоки, слои и структурированные комментарии, делают его идеальным решением для проектов любого масштаба. Если вы хотите улучшить свой рабочий процесс проектирования и создавать модульные, повторно используемые и поддерживаемые стили, LayerCSS — это идеальное решение!"
}
