{
  "title": "LayerCSS .lyc",
  "language-selector-label": "Pumili ng Wika:",
  "header-title": "LayerCSS - Wika ng Pagpoprograma",
  "header-license": "Lisensya: Apache 2.0",
  "introduction-title": "Panimula",
  "introduction-description": "<strong>Ano ang LayerCSS?</strong> Ang LayerCSS ay isang wika ng disenyo na batay sa CSS na nagpapakilala ng mga advanced na katangian upang gawing mas madali ang paglikha ng mga modular, reusable, at maintainable na estilo.",
  "introduction-quote": "Modularity: Hatiin ang iyong mga estilo sa lohikal na mga seksyon.<br>Reusability: Tukuyin ang mga halaga nang isang beses at gamitin sa maraming lugar.<br>Facilitate Maintenance: Baguhin ang isang halaga sa isang lugar at maapektuhan ang buong proyekto.",
  "introduction-creator": "<em>Gumawa:</em> Sebastián (Balthier) Ordoñez Arias, isang amateur na programmer na may pangunahing kaalaman sa web design at pagbuo ng aplikasyon.",
  "lyc-title": "Ano ang .lyc?",
  "lyc-description": "Ang `.lyc` file format ay ang core ng LayerCSS. Ito ay nagpapalawig ng tradisyonal na CSS sa pamamagitan ng pagpapakilala ng bagong syntax at mga katangian na ginagawang mas intuitive at efficient ang styling.",
  "lyc-feature-syntax": "<strong>Syntax:</strong> Katulad ng CSS pero may dagdag na mga katangian tulad ng variables, nesting, at layers.",
  "lyc-feature-modularity": "<strong>Modularity:</strong> Ayusin ang iyong mga estilo sa reusable components.",
  "lyc-feature-compilation": "<strong>Compilation:</strong> Ang `.lyc` files ay kinokompila sa standard na CSS para sa compatibility ng browser.",
  "features-title": "Mga Pangunahing Katangian",
  "feature-global-variables": "<strong>Global at Local Variables:</strong> Tukuyin ang reusable values tulad ng kulay at font sizes.",
  "feature-nested-blocks": "<strong>Nested Blocks:</strong> Isulat ang mga estilo nang hierarchical para sa mas mahusay na readability.",
  "feature-layers": "<strong>Layers (@layer):</strong> Ayusin ang mga estilo sa lohikal na mga seksyon.",
  "feature-comments": "<strong>Structured Comments:</strong> Gamitin ang single-line at multi-line comments para sa dokumentasyon.",
  "feature-animations": "<strong>Animations and Keyframes:</strong> Pasimplehin ang dynamic na visual effects.",
  "example-title": "Detalyadong Halimbawa",
  "example-description": "Sa ibaba ay isang basic example ng isang `.lyc` file na may detalyadong komento na nagpapaliwanag sa bawat bahagi ng code. Ang file na ito ay gumagamit ng fundamental na mga katangian ng LYC: <strong>global variables</strong>, <strong>`calc()`</strong>, <strong>mixins (`@mixin` at `@include`)</strong>, at <strong>inheritance with `@extend`</strong>.",
  "example-lyc-title": "Halimbawa ng Code ng LYC",
  "example-lyc-description": "Sa ibaba ay isang halimbawa ng code ng LYC na maaari mong i-copy at i-paste sa compiler upang subukan ang mga feature nito.",
  "comparison-title": "Pagkukumpara: .lyc vs .css",
  "comparison-characteristic": "Katangian",
  "comparison-variables": "Variables",
  "comparison-nested-blocks": "Nested Blocks",
  "comparison-layers": "Layers",
  "comparison-comments": "Comments",
  "comparison-animations": "Animations",
  "comparison-learning-curve": "Learning Curve",
  "sass-variables": "Suportado",
  "less-variables": "Suportado",
  "postcss-variables": "Suportado sa pamamagitan ng plugins",
  "layercss-variables": "Native support",
  "sass-nested-blocks": "Suportado",
  "less-nested-blocks": "Suportado",
  "postcss-nested-blocks": "Suportado sa pamamagitan ng plugins",
  "layercss-nested-blocks": "Native support",
  "sass-layers": "Hindi suportado",
  "less-layers": "Hindi suportado",
  "postcss-layers": "Suportado sa pamamagitan ng plugins",
  "layercss-layers": "Native support",
  "sass-comments": "Standard CSS comments",
  "less-comments": "Standard CSS comments",
  "postcss-comments": "Standard CSS comments",
  "layercss-comments": "Structured comments",
  "sass-animations": "Suportado",
  "less-animations": "Suportado",
  "postcss-animations": "Suportado sa pamamagitan ng plugins",
  "layercss-animations": "Native support",
  "sass-learning-curve": "Katamtaman",
  "less-learning-curve": "Madali",
  "postcss-learning-curve": "Katamtaman",
  "layercss-learning-curve": "Madali",
  "compiler-title": "Compiler Space",
  "compile-button": "I-kompile",
  "code-input": "Isulat ang iyong LayerCSS code dito...",
  "output": "CSS Output",
  "processTitle": "Kasalukuyan at Hinaharap na Proseso",
  "currentProcessTitle": "Saan Tayo Sa Proseso?",
  "currentProcessDescription": "Hanggang ngayon, naimpluwensya na namin ang isang bahagyang preprosesador o tagapagsalin para sa wika ng LYC. Ang preprosesador na ito ay nagbibigay ng mga sumusunod na gawain:",
  "currentProcessFeatureVars": "Pagpapalit ng variable: Pinoproseso ang mga pangkalahatang at lokal na variable (gamit ang var(--pangalan)).",
  "currentProcessFeatureMath": "Mga mathematical expression: Nag-evaluate ng mga expression sa loob ng calc().",
  "currentProcessFeatureMixins": "Mixins (@mixin at @include): Pinapayagan ang paggamit muli ng code gamit ang mixins.",
  "currentProcessFeatureExtend": "Pagmamana gamit ang @extend: Ginagamit muli ang mga estilo sa pagitan ng mga selector.",
  "currentProcessFeatureDynamic": "Dinamikong istruktura: Gumagamit ng malloc at realloc para pamahalaan ang mga variable, mixin, at iba pang elemento nang dinamiko.",
  "currentProcessFeatureLocalScope": "Lokal na saklaw: Ang mga lokal na variable ay nakaimbak sa stack at hindi lumilitaw sa output file.",
  "currentProcessNote": "Gayunpaman, ito lamang ay isang bahagyang compiler, dahil marami pang mahahalagang yugto ng proseso ng compilation ang kailangang ipatupad.",
  "compilerStagesTitle": "Ano Ang Idadagdag",
  "compilerStagesDescription": "Upang gawing ganap na compiler ang aming preprosesador, kailangan naming idagdag ang mga sumusunod na katangian:",
  "compilerStagesSubtitle": "A. Mga Yugto ng Ganap na Compiler",
  "compilerStageLexing": "Paggawa ng Lexical Analysis (Lexing): Ikinakansela ang source code sa mga token (mga keyword, identifier, operator, atbp.).",
  "compilerStageParsing": "Paggawa ng Syntactic Analysis (Parsing): Nililikha ang Abstract Syntax Tree (AST) mula sa mga token na nabuo ng lexer.",
  "compilerStageSemantic": "Semantic Analysis: Sinusuri kung valid ang AST ayon sa mga alituntunin ng wika.",
  "compilerStageIntermediateCode": "Paglikha ng Intermediate Code: Ina-translate ang AST sa intermediate format na mas madaling i-optimize o i-compile.",
  "compilerStageOptimization": "Optimisasyon: Pinapabuti ang intermediate code para maging mas epektibo.",
  "compilerStageFinalCode": "Paglikha ng Final Code: Lumilikha ng output file sa nais na format (sa kasong ito, CSS).",
  "additionalFeaturesTitle": "B. Mga Karagdagang Katangian Na Maidagdag",
  "additionalFeaturesDescription": "Sa karagdagan sa mga yugto ng compiler, maidagdag pa natin ang mga sumusunod na espesipikong katangian para sa LYC:",
  "additionalFeatureFunctions": "Suporta para sa Advanced Functions: Mag-implement ng custom functions sa LYC, tulad ng darken(color, percentage) o lighten(color, percentage).",
  "additionalFeatureNestedRules": "Advanced Nested Rules: Payagan ang mas kumplikadong nested CSS rules, katulad ng mga matatagpuan sa SASS o LESS.",
  "additionalFeatureStrictMode": "Strict Mode: Magdagdag ng strict mode na makikilala ang potensyal na error, tulad ng hindi ginagamit na mga variable o duplicate rules.",
  "additionalFeatureToolsIntegration": "Compatibility sa Panlabas na Tools: I-integrate ang LYC sa mga tool tulad ng PostCSS o Autoprefixer para mapabuti ang browser compatibility.",
  "additionalFeatureMinification": "Awtomatikong Minification: Magdagdag ng option para awtomatikong likhain ang minified CSS.",
  "additionalFeatureDebugging": "Debugging: Isama ang mga komento sa nabuong CSS para mapadali ang debugging.",
  "additionalFeatureDocumentation": "Dokumentasyon at Mga Halimbawa: Lumikha ng detalyadong dokumentasyon para sa LYC at magbigay ng mga halimbawa ng paggamit.",
  "conclusion-title": "Konklusyon",
  "conclusion-description": "Ang LayerCSS ay nagpapasimple sa CSS development gamit ang mga advanced na katangian tulad ng variables, nested blocks, at layers. Ito ay ideal para sa parehong maliit at malalaking proyekto.",
  "conclusion-note": "<em>Tandaan mula sa Gumawa:</em> Ang proyektong ito ay nasa unang yugto pa lamang. Ang iyong kontribusyon ay magiging napakahalaga!",
  "footer-text": "&copy; 2025 LayerCSS. Ipinamamahagi sa ilalim ng Lisensyang Apache 2.0."
}
