{
  "title": "LayerCSS .lyc",
  "language-selector-label": "Pumili ng Wika:",
  "header-title": "LayerCSS - Wika ng Pagpoprograma",
  "header-license": "Lisensya: Apache 2.0",
  "introduction-title": "1. Panimula",
  "introduction-description": "<strong>Ano ang LayerCSS?</strong> Ang LayerCSS ay isang wika ng disenyo batay sa CSS na nagpapakilala ng mga advanced na katangian upang mapadali ang paglikha ng mga estilo na modular, maaaring gamitin muli, at madaling panghawakan. Ito ay dinisenyo upang malampasan ang mga limitasyon ng tradisyonal na CSS sa pamamagitan ng pagdaragdag ng suporta para sa mga global at lokal na variable, nested blocks, layers (@layer), at structured comments.",
  "introduction-quote": "Modularity: Hatiin ang iyong mga estilo sa mga lohikal na seksyon.<br>Reusability: Tukuyin ang mga halaga sa isang beses at gamitin ito sa maraming lugar.<br>Ease of Maintenance: Baguhin ang isang halaga sa isang lugar at maapektuhan ang buong proyekto.",
  "introduction-creator": "<em>Likha ni:</em> Sebastian (Balthier) Ordoñez Arias, isang amateur na programmer na may pangunahing kaalaman sa web design at pagbuo ng aplikasyon. Ang proyektong ito ay ipinanganak bilang isang personal na eksplorasyon upang pasimplehin ang pagbuo ng CSS at gawin itong madaling ma-access ng lahat.",
  "lyc-title": "2. Ano ang .lyc?",
  "lyc-description": "Ang format ng file na `.lyc` ay ang puso ng LayerCSS. Ito ay nagpapalawig sa tradisyonal na CSS sa pamamagitan ng pagpapakilala ng bagong syntax at mga katangian na ginagawang mas intuitive at mahusay ang pag-style. Narito ang ilang mga pangunahing aspeto:",
  "lyc-feature-syntax": "<strong>Syntax:</strong> Katulad ng CSS ngunit may karagdagang mga katangian tulad ng mga variable, nesting, at layers.",
  "lyc-feature-modularity": "<strong>Modularity:</strong> Ayusin ang iyong mga estilo sa mga reusable na komponente.",
  "lyc-feature-compilation": "<strong>Compilation:</strong> Ang mga file na `.lyc` ay kinokompila sa standard na CSS para sa compatibility sa browser.",
  "features-title": "3. Mga Pangunahing Katangian",
  "feature-global-variables": "<strong>Mga Global at Lokal na Variable:</strong> Tukuyin ang mga reusable na halaga tulad ng mga kulay at laki ng font.",
  "feature-nested-blocks": "<strong>Nested Blocks:</strong> Isulat ang mga estilo nang hierarkikal upang mapabuti ang readability.",
  "feature-layers": "<strong>Layers (@layer):</strong> Ayusin ang mga estilo sa lohikal na mga seksyon.",
  "feature-comments": "<strong>Structured Comments:</strong> Gamitin ang single-line at multi-line na mga komento para sa dokumentasyon.",
  "feature-animations": "<strong>Animations at Keyframes:</strong> Pasimplehin ang mga dynamic na visual effects.",
  "example-title": "4. Detalyadong Halimbawa",
  "example-description": "Sa ibaba ay isang halimbawang basic ng isang file na `.lyc` na may detalyadong mga komento na nagpapaliwanag ng bawat bahagi ng code. Ang file na ito ay gumagamit ng mga fundamental na katangian ng LYC: <strong>mga global na variable</strong>, <strong>`calc()`</strong>, <strong>mixins (`@mixin` at `@include`)</strong>, at <strong>pamana gamit ang `@extend`</strong>.",
  "comparison-title": "Pagkumpara: .lyc vs .css",
  "compiler-title": "5. Espasyo ng Compiler",
  "conclusion-title": "6. Konklusyon",
  "conclusion-description": "Pinapasimple ng LayerCSS ang pagbuo ng CSS sa tulong ng mga advanced na katangian tulad ng mga variable, nested blocks, at layers. Ito ay ideal para sa parehong maliit at malalaking proyekto.",
  "conclusion-note": "<em>Tandaan ng Likha:</em> Nasa unang yugto pa lamang ang proyektong ito. Ang iyong kontribusyon ay walang presyo!",
  "footer-text": "&copy; 2025 LayerCSS. Ipinamamahagi sa ilalim ng Lisensyang Apache 2.0."
}
